In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns


pd.set_option('display.max_columns', None)

In [11]:
df_loyalty  = pd.read_csv("Customer Loyalty History.csv", index_col= 0)
df_loyalty.head()

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [13]:
df_f_activity  = pd.read_csv("Customer Flight Activity.csv", index_col= 0)
df_f_activity.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

## EDA

In [14]:
print(f"El número de filas que tenemos en Customer Loyalty History es {df_loyalty.shape[0]}, y el número de columnas es {df_loyalty.shape[1]}")

El número de filas que tenemos en Customer Loyalty History es 16737, y el número de columnas es 15

In [15]:
print(f"El número de filas que tenemos en Customer Fligth Activity es {df_f_activity.shape[0]}, y el número de columnas es {df_f_activity.shape[1]}")

El número de filas que tenemos en Customer Fligth Activity es 405624, y el número de columnas es 9

In [18]:
df_loyalty.columns

Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [19]:
df_f_activity.columns

Index(['Year', 'Month', 'Flights Booked', 'Flights with Companions',
       'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [42]:
df_loyalty.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16737 entries, 480934 to 652627
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             16737 non-null  object
 1   Province            16737 non-null  object
 2   City                16737 non-null  object
 3   Postal Code         16737 non-null  object
 4   Gender              16737 non-null  object
 5   Education           16737 non-null  object
 6   Salary              12499 non-null  float64
 7   Marital Status      16737 non-null  object
 8   Loyalty Card        16737 non-null  object
 9   CLV                 16737 non-null  float64
 10  Enrollment Type     16737 non-null  object
 11  Enrollment Year     16737 non-null  int64
 12  Enrollment Month    16737 non-null  int64
 13  Cancellation Year   2067 non-null   float64
 14  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(2), object(9)
memory usage: 2.0+ MB

In [43]:
df_f_activity.info()

<class 'pandas.core.frame.DataFrame'>
Index: 405624 entries, 100018 to 999986
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Year                         405624 non-null  int64
 1   Month                        405624 non-null  int64
 2   Flights Booked               405624 non-null  int64
 3   Flights with Companions      405624 non-null  int64
 4   Total Flights                405624 non-null  int64
 5   Distance                     405624 non-null  int64
 6   Points Accumulated           405624 non-null  float64
 7   Points Redeemed              405624 non-null  int64
 8   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(8)
memory usage: 30.9 MB

In [37]:
(df_loyalty.isna().sum() / df_loyalty.shape[0]) * 100

Country                0.000000
Province               0.000000
City                   0.000000
Postal Code            0.000000
Gender                 0.000000
Education              0.000000
Salary                25.321145
Marital Status         0.000000
Loyalty Card           0.000000
CLV                    0.000000
Enrollment Type        0.000000
Enrollment Year        0.000000
Enrollment Month       0.000000
Cancellation Year     87.650117
Cancellation Month    87.650117
dtype: float64

In [41]:
(df_f_activity.isna().sum() / df_f_activity.shape[0]) * 100 #no encontramos valores nulos en este DF

Year                           0.0
Month                          0.0
Flights Booked                 0.0
Flights with Companions        0.0
Total Flights                  0.0
Distance                       0.0
Points Accumulated             0.0
Points Redeemed                0.0
Dollar Cost Points Redeemed    0.0
dtype: float64

In [46]:
df_cat = df_loyalty.select_dtypes(include = "object") #definimos las columnas categoricas de df_loyalty
df_cat.head()

,Country,Province,City,Postal Code,Gender,Education,Marital Status,Loyalty Card,Enrollment Type
Loyalty Number,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,Married,Star,Standard
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,Divorced,Star,Standard
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,Single,Star,Standard
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,Single,Star,Standard
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,Married,Star,Standard

In [47]:
df_num = df_loyalty.select_dtypes(include = ["int", 'float']) #definimos las columnas numéricas de df_loyalty
df_num.head()

,Salary,CLV,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,
480934,83236.0,3839.14,2016,2,NaN,NaN
549612,NaN,3839.61,2016,3,NaN,NaN
429460,NaN,3839.75,2014,7,2018.0,1.0
608370,NaN,3839.75,2013,2,NaN,NaN
530508,103495.0,3842.79,2014,10,NaN,NaN

In [48]:
df_num2 = df_f_activity.select_dtypes(include = ["int", 'float']) #definimos las columnas numéricas de df_loyalty
df_num2.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

In [45]:
df_loyalty.describe(include = "object").T

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

In [50]:
#df_f_activity.describe(include = "object").T  no hay columnas categóricas

In [51]:
df_loyalty.describe().T #consultamos los principales estadísticos del DF

,count,mean,std,min,25%,50%,75%,max
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

In [52]:
df_f_activity.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

In [53]:
df_loyalty.duplicated().sum()

np.int64(0)

In [55]:
df_f_activity.duplicated().sum()

np.int64(228705)

In [ ]:
df = pd.merge(df_loyalty, df_f_activity, on='Loyalty Number', how='inner') #juntamos los dos archivos

In [60]:
df.isna().sum() / df.shape[0] *100 #anaizamos los datos nulos en conjunto y vemos que coinciden con los nulos de los df por separado

Country                         0.000000
Province                        0.000000
City                            0.000000
Postal Code                     0.000000
Gender                          0.000000
Education                       0.000000
Salary                         25.312112
Marital Status                  0.000000
Loyalty Card                    0.000000
CLV                             0.000000
Enrollment Type                 0.000000
Enrollment Year                 0.000000
Enrollment Month                0.000000
Cancellation Year              87.657535
Cancellation Month             87.657535
Year                            0.000000
Month                           0.000000
Flights Booked                  0.000000
Flights with Companions         0.000000
Total Flights                   0.000000
Distance                        0.000000
Points Accumulated              0.000000
Points Redeemed                 0.000000
Dollar Cost Points Redeemed     0.000000
dtype: float64

## LIMPIEZA

In [65]:
df.columns = df.columns.str.lower() #ponemos el nombre de las columnas en minuscula
df.columns

Index(['country', 'province', 'city', 'postal code', 'gender', 'education',
       'salary', 'marital status', 'loyalty card', 'clv', 'enrollment type',
       'enrollment year', 'enrollment month', 'cancellation year',
       'cancellation month', 'year', 'month', 'flights booked',
       'flights with companions', 'total flights', 'distance',
       'points accumulated', 'points redeemed', 'dollar cost points redeemed'],
      dtype='object')

In [72]:
df.sample(5)

,country,province,city,postal code,gender,education,salary,marital status,loyalty card,clv,enrollment type,enrollment year,enrollment month,cancellation year,cancellation month,year,month,flights booked,flights with companions,total flights,distance,points accumulated,points redeemed,dollar cost points redeemed
Loyalty Number,,,,,,,,,,,,,,,,,,,,,,,,
701732,Canada,Ontario,Thunder Bay,K8T 5M5,Female,Doctor,232255.0,Single,Aurora,5639.40,Standard,2018,10,NaN,NaN,2018,2,0,0,0,0,0.0,0,0
987482,Canada,Quebec,Quebec City,G1B 3L5,Male,Bachelor,76329.0,Married,Nova,2803.60,Standard,2012,5,NaN,NaN,2017,7,11,0,11,3883,388.0,0,0
451042,Canada,Ontario,Thunder Bay,K8T 5M5,Male,Bachelor,50085.0,Married,Nova,4711.04,Standard,2015,5,2016.0,1.0,2017,11,0,0,0,0,0.0,0,0
946525,Canada,Manitoba,Winnipeg,R6Y 4T5,Female,Bachelor,78672.0,Married,Star,8836.03,Standard,2013,11,NaN,NaN,2018,12,5,0,5,565,56.0,0,0
531515,Canada,Alberta,Calgary,T3E 2V9,Male,Bachelor,76606.0,Married,Nova,2764.49,Standard,2017,7,NaN,NaN,2017,1,0,0,0,0,0.0,0,0

In [70]:
df['salary'].describe().reset_index().T

,0,1,2,3,4,5,6,7
index,count,mean,std,min,25%,50%,75%,max
salary,302952.0,79268.825953,34992.133508,-58486.0,59262.0,73479.0,88612.0,407228.0

In [73]:
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')

In [76]:
mean_education = df.groupby('education')['salary'].mean().sort_values().reset_index()

In [77]:
mean_education

              education         salary
0  High School or Below   60986.544192
1              Bachelor   72476.211860
2                Master  103767.494163
3                Doctor  178335.439516
4               College            NaN

In [ ]:

df['salary'] = pd.to_numeric(df['salary'], errors='coerce') #volver a ejecutar

nulos_por_educacion = df.groupby('education')['salary'].apply(lambda x: x.isnull().sum())

print("🔢 Conteo de Valores Nulos en 'Salary' por Nivel Educativo:\n")
print(nulos_por_educacion)

🔢 Conteo de Valores Nulos en 'Salary' por Nivel Educativo:

education
Bachelor                0
College                 0
Doctor                  0
High School or Below    0
Master                  0
Name: salary, dtype: int64

In [88]:
no_nulos_por_educacion = df.groupby('education')['salary'].count().sort_values()

print("✅ Conteo de Registros de 'Salary' NO Nulos por Nivel Educativo:\n")
display(no_nulos_por_educacion)

✅ Conteo de Registros de 'Salary' NO Nulos por Nivel Educativo:

education
College                      0
Master                   12336
Doctor                   17856
High School or Below     19008
Bachelor                253752
Name: salary, dtype: int64

In [87]:
df.groupby('education')['salary'].mean().sort_values()

education
High School or Below     60986.544192
Bachelor                 72476.211860
Master                  103767.494163
Doctor                  178335.439516
College                           NaN
Name: salary, dtype: float64

In [ ]:
salario_high_school = 60986.544192
salario_bachelor = 72476.211860

salario_college_estimado = (salario_high_school + salario_bachelor) / 2

print(f"Salario de 'High School or Below': {salario_high_school:,.2f}")
print(f"Salario de 'Bachelor': {salario_bachelor:,.2f}")
print("-" * 35)
print(f"💰 Salario Estimado para 'College': {salario_college_estimado:,.2f}")

Salario de 'High School or Below': 60,986.54
Salario de 'Bachelor': 72,476.21
-----------------------------------
💰 Salario Estimado para 'College': 66,731.38

In [90]:
# Define el valor calculado para la imputación
valor_imputacion_college = 66731.38

# Usa .loc para seleccionar las filas:
# 1. Donde 'education' es 'College'
# 2. Y donde 'salary' ES NULO (.isnull())
# Luego, asigna el valor estimado a la columna 'salary' en esas filas.

filas_a_imputar = (df['education'] == 'College') & (df['salary'].isnull())

df.loc[filas_a_imputar, 'salary'] = valor_imputacion_college

# Verifica la imputación
print("\nVerificación de imputación:")
print(f"Nulos restantes en 'salary' para 'College':")
print(df[df['education'] == 'College']['salary'].isnull().sum())

Verificación de imputación:
Nulos restantes en 'salary' para 'College':
0

In [95]:
df.groupby('education')['salary'].mean().sort_values(ascending=True)

education
High School or Below     60986.544192
College                  66731.380000
Bachelor                 72476.211860
Master                  103767.494163
Doctor                  178335.439516
Name: salary, dtype: float64

In [98]:
df['cancellation year'].unique()

array([  nan, 2018., 2015., 2017., 2014., 2016., 2013.])

In [99]:

df['cancellation year'] = df['cancellation year'].fillna(9999)

# Convertir la columna a entero (usamos 'Int64' de Pandas para manejar NaNs si fuera necesario,
# pero como ya los llenamos, 'int' también funcionaría, aunque 'Int64' es más seguro).
df['cancellation year'] = df['cancellation year'].astype('Int64')

# --- Columna: Cancellation Month ---
# Rellenar nulos con un valor sentinel (0 para indicar 'Activo')
df['cancellation month'] = df['cancellation month'].fillna(0)

# Convertir la columna a entero
df['cancellation month'] = df['cancellation month'].astype('Int64')

print("✅ Columnas de cancelación convertidas a enteros y nulos imputados con valores sentinel.")
print(df[['cancellation year', 'cancellation month']].dtypes)

✅ Columnas de cancelación convertidas a enteros y nulos imputados con valores sentinel.
cancellation year     Int64
cancellation month    Int64
dtype: object

In [ ]:
df.isna().sum() / df.shape[0] *100 #comprobamos que ya no hay nulos

country                        0.0
province                       0.0
city                           0.0
postal code                    0.0
gender                         0.0
education                      0.0
salary                         0.0
marital status                 0.0
loyalty card                   0.0
clv                            0.0
enrollment type                0.0
enrollment year                0.0
enrollment month               0.0
cancellation year              0.0
cancellation month             0.0
year                           0.0
month                          0.0
flights booked                 0.0
flights with companions        0.0
total flights                  0.0
distance                       0.0
points accumulated             0.0
points redeemed                0.0
dollar cost points redeemed    0.0
dtype: float64